<?php

/* Header ---------------------------------- */

require_once '../views/component/header.php';

/* --------------------------------------------- */


/* DB 설정파일 ---------------------------------- */

require_once '../config.php';

/* --------------------------------------------- */


/* 클래스 오토로드 ------------------------------ */

require_once '../vendor/autoload.php';

/* --------------------------------------------- */


/* 라우터 -------------------------------------- */

// 사용자 정의한 라우터 불러오기

require_once __DIR__."/../routes/web.php";

// auth 관련 라우터

require_once __DIR__."/../routes/auth.php";

// 사용자 정의한 라우터에 uri 없을시 뷰 404 처리

new NotFound();

/* -------------------------------------------- */


// $router = new Router(new Request);

/* Footer ---------------------------------- */

require_once '../views/component/footer.php';

/* --------------------------------------------- */
