<?php

/* DB 설정파일 ---------------------------------- */

require_once '../config.php';

/* --------------------------------------------- */

/* DB Pool


/* 클래스 오토로드 ------------------------------ */

require_once '../vendor/autoload.php';

/* --------------------------------------------- */


/* 라우터 -------------------------------------- */

// 사용자 정의한 라우터 불러오기

require_once __DIR__."/../routes/web.php";

// 사용자 정의한 라우터에 uri 없을시 뷰 404 처리

new NotFound();

/* -------------------------------------------- */


// $router = new Router(new Request);
